Revit 2027 API
DimensionSegment.LeaderEndPosition Property
The position of the dimension leader end point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ LeaderEndPosition { get; set; }
Public Property LeaderEndPosition As XYZ
	Get
	Set
public:
property XYZ^ LeaderEndPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
member LeaderEndPosition : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ApplicationException |  Thrown when the dimension text is unavailable.
InvalidOperationException |  Thrown when:
The dimension text is a SpotElevation
When using equality formula.
When dimension style is ordinate.
Remarks
This property is not applicable to all dimensions. For example, it is not available for spot dimensions, dimensions using equality formula, and when dimension style is ordinate.
If the position is not applicable, this property returns NULL and will not allow setting a value.
See Also
Reference
DimensionSegment Class
Autodesk.Revit.DB Namespace